Masmiseim36/iMXRT/targets/iMXRText/devices/iMXRT600/periph/PERI_ESPI.h
/*
** ###################################################################
**     Processors:          MIMXRT633SFAWBR
**                          MIMXRT633SFFOB
**                          MIMXRT633SFVKB
**                          MIMXRT685SFAWBR_cm33
**                          MIMXRT685SFAWBR_dsp
**                          MIMXRT685SFFOB_cm33
**                          MIMXRT685SFFOB_dsp
**                          MIMXRT685SFVKB_cm33
**                          MIMXRT685SFVKB_dsp
**                          MIMXRT685SVFVKB_cm33
**                          MIMXRT685SVFVKB_dsp
**
**     Version:             rev. 3.0, 2024-10-29
**     Build:               b250520
**
**     Abstract:
**         CMSIS Peripheral Access Layer for ESPI
**
**     Copyright 1997-2016 Freescale Semiconductor, Inc.
**     Copyright 2016-2025 NXP
**     SPDX-License-Identifier: BSD-3-Clause
**
**     http:                 www.nxp.com
**     mail:                 support@nxp.com
**
**     Revisions:
**     - rev. 1.0 (2018-06-19)
**         Initial version.
**     - rev. 2.0 (2019-11-12)
**         Base on rev 0.95 RM (B0 Header)
**     - rev. 3.0 (2024-10-29)
**         Change the device header file from single flat file to multiple files based on peripherals,
**         each peripheral with dedicated header file located in periphN folder.
**
** ###################################################################
*/

/*!
 * @file PERI_ESPI.h
 * @version 3.0
 * @date 2024-10-29
 * @brief CMSIS Peripheral Access Layer for ESPI
 *
 * CMSIS Peripheral Access Layer for ESPI
 */

#if !defined(PERI_ESPI_H_)
#define PERI_ESPI_H_                             /**< Symbol preventing repeated inclusion */

#if (defined(CPU_MIMXRT633SFAWBR) || defined(CPU_MIMXRT633SFFOB) || defined(CPU_MIMXRT633SFVKB))
#include "../MIMXRT633S_COMMON.h"
#elif (defined(CPU_MIMXRT685SFAWBR_cm33) || defined(CPU_MIMXRT685SFFOB_cm33) || defined(CPU_MIMXRT685SFVKB_cm33) || defined(CPU_MIMXRT685SVFVKB_cm33))
#include "../MIMXRT685S_cm33_COMMON.h"
#elif (defined(CPU_MIMXRT685SFAWBR_dsp) || defined(CPU_MIMXRT685SFFOB_dsp) || defined(CPU_MIMXRT685SFVKB_dsp) || defined(CPU_MIMXRT685SVFVKB_dsp))
#include "../MIMXRT685S_dsp_COMMON.h"
#else
  #error "No valid CPU defined!"
#endif

/* ----------------------------------------------------------------------------
   -- Device Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup Peripheral_access_layer Device Peripheral Access Layer
 * @{
 */


/*
** Start of section using anonymous unions
*/

#if defined(__ARMCC_VERSION)
  #if (__ARMCC_VERSION >= 6010050)
    #pragma clang diagnostic push
  #else
    #pragma push
    #pragma anon_unions
  #endif
#elif defined(__GNUC__)
  /* anonymous unions are enabled by default */
#elif defined(__IAR_SYSTEMS_ICC__)
  #pragma language=extended
#elif defined(__XTENSA__)
  /* anonymous unions are enabled by default */
#else
  #error Not supported compiler type
#endif

/* ----------------------------------------------------------------------------
   -- ESPI Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup ESPI_Peripheral_Access_Layer ESPI Peripheral Access Layer
 * @{
 */

/** ESPI - Size of Registers Arrays */
#define ESPI_PORT_COUNT                           5u

/** ESPI - Register Layout Typedef */
typedef struct {
  __IO uint32_t MCTRL;                             /**< Master Control for whole peripheral, offset: 0x0 */
  __IO uint32_t MSTAT;                             /**< Master Status of whole peripheral, offset: 0x4 */
  __IO uint32_t INTENSET;                          /**< Interrupt Set (enable), offset: 0x8 */
  __IO uint32_t INTENCLR;                          /**< Interrupt Clear (disable), offset: 0xC */
  __IO uint32_t INTSTAT;                           /**< Masked interrupt status (causes), offset: 0x10 */
  __IO uint32_t DMACTRL;                           /**< Selects DMA for Ports (if used), offset: 0x14 */
  __IO uint32_t RAMBASE;                           /**< Address of RAM to use for data. This tells the application where the RAM is located (up to 16K addressable)., offset: 0x18 */
  __IO uint32_t MAPBASE;                           /**< Base0 and Base1 mapped offsets for ports, offset: 0x1C */
  __IO uint32_t IRQPUSH;                           /**< IRQ to drive into Host (with eSPI), offset: 0x20 */
  __IO uint32_t WIREWO;                            /**< Wire states for Host to see; if LPC, this is the IRQ states., offset: 0x24 */
  __I  uint32_t WIRERO;                            /**< Wire states from Host, offset: 0x28 */
       uint8_t RESERVED_0[4];
  __IO uint32_t P80STAT;                           /**< Port 80 Status (byte and prev byte), offset: 0x30 */
  __IO uint32_t STATADDR;                          /**< Location of Status block in memory space, if enabled., offset: 0x34 */
       uint8_t RESERVED_1[8];
  __IO uint32_t ESPICAP;                           /**< eSPI Capabilities of MCU to send to Host, offset: 0x40 */
  __I  uint32_t ESPICFG;                           /**< eSPI Configuration settings from eSPI, offset: 0x44 */
  __IO uint32_t ESPIMISC;                          /**< Miscellaneous uses, such as Alert pin as GPIO (when not used for Alert)., offset: 0x48 */
       uint8_t RESERVED_2[180];
  struct {                                         /* offset: 0x100, array step: 0x20 */
    __IO uint32_t CFG;                               /**< array offset: 0x100, array step: 0x20 */
    __IO uint32_t STAT;                              /**< array offset: 0x104, array step: 0x20 */
    __IO uint32_t IRULESTAT;                         /**< array offset: 0x108, array step: 0x20 */
    union {                                          /* offset: 0x10C, array step: 0x20 */
      __IO uint32_t ADDR;                              /**< array offset: 0x10C, array step: 0x20 */
      __IO uint32_t OMFLEN;                            /**< array offset: 0x10C, array step: 0x20 */
    };
    __I  uint32_t DATAIN;                            /**< array offset: 0x110, array step: 0x20 */
    union {                                          /* offset: 0x114, array step: 0x20 */
      __IO uint32_t DATAOUT;                           /**< array offset: 0x114, array step: 0x20 */
      __IO uint32_t RAMUSE;                            /**< array offset: 0x114, array step: 0x20 */
    };
         uint8_t RESERVED_0[8];
  } PORT[ESPI_PORT_COUNT];
} ESPI_Type;

/* ----------------------------------------------------------------------------
   -- ESPI Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup ESPI_Register_Masks ESPI Register Masks
 * @{
 */

/*! @name MCTRL - Master Control for whole peripheral */
/*! @{ */

#define ESPI_MCTRL_ENABLE_MASK                   (0x3U)
#define ESPI_MCTRL_ENABLE_SHIFT                  (0U)
/*! ENABLE
 *  0b00..Disabled. Block is not operational
 *  0b01..eSPI
 *  0b10..LPC
 *  0b11..Reserved
 */
#define ESPI_MCTRL_ENABLE(x)                     (((uint32_t)(((uint32_t)(x)) << ESPI_MCTRL_ENABLE_SHIFT)) & ESPI_MCTRL_ENABLE_MASK)

#define ESPI_MCTRL_PENA_MASK                     (0x1F00U)
#define ESPI_MCTRL_PENA_SHIFT                    (8U)
/*! PENA - Port enable bits. */
#define ESPI_MCTRL_PENA(x)                       (((uint32_t)(((uint32_t)(x)) << ESPI_MCTRL_PENA_SHIFT)) & ESPI_MCTRL_PENA_MASK)

#define ESPI_MCTRL_P80ENA_MASK                   (0x10000U)
#define ESPI_MCTRL_P80ENA_SHIFT                  (16U)
/*! P80ENA - Port 80 enable. */
#define ESPI_MCTRL_P80ENA(x)                     (((uint32_t)(((uint32_t)(x)) << ESPI_MCTRL_P80ENA_SHIFT)) & ESPI_MCTRL_P80ENA_MASK)

#define ESPI_MCTRL_SBLKENA_MASK                  (0x20000U)
#define ESPI_MCTRL_SBLKENA_SHIFT                 (17U)
/*! SBLKENA - Status block is enabled and mapped according to the STATADDR register. */
#define ESPI_MCTRL_SBLKENA(x)                    (((uint32_t)(((uint32_t)(x)) << ESPI_MCTRL_SBLKENA_SHIFT)) & ESPI_MCTRL_SBLKENA_MASK)

#define ESPI_MCTRL_USE60MHZ_MASK                 (0x100000U)
#define ESPI_MCTRL_USE60MHZ_SHIFT                (20U)
#define ESPI_MCTRL_USE60MHZ(x)                   (((uint32_t)(((uint32_t)(x)) << ESPI_MCTRL_USE60MHZ_SHIFT)) & ESPI_MCTRL_USE60MHZ_MASK)
/*! @} */

