Masmiseim36/iMXRT/targets/iMXRText/devices/iMXRT600/periph/PERI_ESPI.h
/*! @name MSTAT - Master Status of whole peripheral */
/*! @{ */

#define ESPI_MSTAT_PORTINT_MASK                  (0x1FU)
#define ESPI_MSTAT_PORTINT_SHIFT                 (0U)
#define ESPI_MSTAT_PORTINT(x)                    (((uint32_t)(((uint32_t)(x)) << ESPI_MSTAT_PORTINT_SHIFT)) & ESPI_MSTAT_PORTINT_MASK)

#define ESPI_MSTAT_P80INT_MASK                   (0x100U)
#define ESPI_MSTAT_P80INT_SHIFT                  (8U)
#define ESPI_MSTAT_P80INT(x)                     (((uint32_t)(((uint32_t)(x)) << ESPI_MSTAT_P80INT_SHIFT)) & ESPI_MSTAT_P80INT_MASK)

#define ESPI_MSTAT_BUSRST_MASK                   (0x200U)
#define ESPI_MSTAT_BUSRST_SHIFT                  (9U)
#define ESPI_MSTAT_BUSRST(x)                     (((uint32_t)(((uint32_t)(x)) << ESPI_MSTAT_BUSRST_SHIFT)) & ESPI_MSTAT_BUSRST_MASK)

#define ESPI_MSTAT_IRQUPD_MASK                   (0x400U)
#define ESPI_MSTAT_IRQUPD_SHIFT                  (10U)
#define ESPI_MSTAT_IRQUPD(x)                     (((uint32_t)(((uint32_t)(x)) << ESPI_MSTAT_IRQUPD_SHIFT)) & ESPI_MSTAT_IRQUPD_MASK)

#define ESPI_MSTAT_WIRECHG_MASK                  (0x800U)
#define ESPI_MSTAT_WIRECHG_SHIFT                 (11U)
#define ESPI_MSTAT_WIRECHG(x)                    (((uint32_t)(((uint32_t)(x)) << ESPI_MSTAT_WIRECHG_SHIFT)) & ESPI_MSTAT_WIRECHG_MASK)

#define ESPI_MSTAT_HSTALL_MASK                   (0x1000U)
#define ESPI_MSTAT_HSTALL_SHIFT                  (12U)
#define ESPI_MSTAT_HSTALL(x)                     (((uint32_t)(((uint32_t)(x)) << ESPI_MSTAT_HSTALL_SHIFT)) & ESPI_MSTAT_HSTALL_MASK)

#define ESPI_MSTAT_CRCERR_MASK                   (0x2000U)
#define ESPI_MSTAT_CRCERR_SHIFT                  (13U)
#define ESPI_MSTAT_CRCERR(x)                     (((uint32_t)(((uint32_t)(x)) << ESPI_MSTAT_CRCERR_SHIFT)) & ESPI_MSTAT_CRCERR_MASK)

#define ESPI_MSTAT_GPIO_MASK                     (0x4000U)
#define ESPI_MSTAT_GPIO_SHIFT                    (14U)
#define ESPI_MSTAT_GPIO(x)                       (((uint32_t)(((uint32_t)(x)) << ESPI_MSTAT_GPIO_SHIFT)) & ESPI_MSTAT_GPIO_MASK)

#define ESPI_MSTAT_BUSY_MASK                     (0x10000U)
#define ESPI_MSTAT_BUSY_SHIFT                    (16U)
#define ESPI_MSTAT_BUSY(x)                       (((uint32_t)(((uint32_t)(x)) << ESPI_MSTAT_BUSY_SHIFT)) & ESPI_MSTAT_BUSY_MASK)

#define ESPI_MSTAT_INRST_MASK                    (0x20000U)
#define ESPI_MSTAT_INRST_SHIFT                   (17U)
#define ESPI_MSTAT_INRST(x)                      (((uint32_t)(((uint32_t)(x)) << ESPI_MSTAT_INRST_SHIFT)) & ESPI_MSTAT_INRST_MASK)

#define ESPI_MSTAT_COMPPEND_MASK                 (0x40000U)
#define ESPI_MSTAT_COMPPEND_SHIFT                (18U)
#define ESPI_MSTAT_COMPPEND(x)                   (((uint32_t)(((uint32_t)(x)) << ESPI_MSTAT_COMPPEND_SHIFT)) & ESPI_MSTAT_COMPPEND_MASK)

#define ESPI_MSTAT_MASTPEND_MASK                 (0x80000U)
#define ESPI_MSTAT_MASTPEND_SHIFT                (19U)
#define ESPI_MSTAT_MASTPEND(x)                   (((uint32_t)(((uint32_t)(x)) << ESPI_MSTAT_MASTPEND_SHIFT)) & ESPI_MSTAT_MASTPEND_MASK)

#define ESPI_MSTAT_ALERTPEND_MASK                (0x100000U)
#define ESPI_MSTAT_ALERTPEND_SHIFT               (20U)
#define ESPI_MSTAT_ALERTPEND(x)                  (((uint32_t)(((uint32_t)(x)) << ESPI_MSTAT_ALERTPEND_SHIFT)) & ESPI_MSTAT_ALERTPEND_MASK)
/*! @} */

/*! @name INTENSET - Interrupt Set (enable) */
/*! @{ */

#define ESPI_INTENSET_PORTINT_MASK               (0x1FU)
#define ESPI_INTENSET_PORTINT_SHIFT              (0U)
#define ESPI_INTENSET_PORTINT(x)                 (((uint32_t)(((uint32_t)(x)) << ESPI_INTENSET_PORTINT_SHIFT)) & ESPI_INTENSET_PORTINT_MASK)

#define ESPI_INTENSET_P80INT_MASK                (0x100U)
#define ESPI_INTENSET_P80INT_SHIFT               (8U)
#define ESPI_INTENSET_P80INT(x)                  (((uint32_t)(((uint32_t)(x)) << ESPI_INTENSET_P80INT_SHIFT)) & ESPI_INTENSET_P80INT_MASK)

#define ESPI_INTENSET_BUSRST_MASK                (0x200U)
#define ESPI_INTENSET_BUSRST_SHIFT               (9U)
#define ESPI_INTENSET_BUSRST(x)                  (((uint32_t)(((uint32_t)(x)) << ESPI_INTENSET_BUSRST_SHIFT)) & ESPI_INTENSET_BUSRST_MASK)

#define ESPI_INTENSET_IRQUPD_MASK                (0x400U)
#define ESPI_INTENSET_IRQUPD_SHIFT               (10U)
#define ESPI_INTENSET_IRQUPD(x)                  (((uint32_t)(((uint32_t)(x)) << ESPI_INTENSET_IRQUPD_SHIFT)) & ESPI_INTENSET_IRQUPD_MASK)

#define ESPI_INTENSET_WIRECHG_MASK               (0x800U)
#define ESPI_INTENSET_WIRECHG_SHIFT              (11U)
#define ESPI_INTENSET_WIRECHG(x)                 (((uint32_t)(((uint32_t)(x)) << ESPI_INTENSET_WIRECHG_SHIFT)) & ESPI_INTENSET_WIRECHG_MASK)

#define ESPI_INTENSET_HSTALL_MASK                (0x1000U)
#define ESPI_INTENSET_HSTALL_SHIFT               (12U)
#define ESPI_INTENSET_HSTALL(x)                  (((uint32_t)(((uint32_t)(x)) << ESPI_INTENSET_HSTALL_SHIFT)) & ESPI_INTENSET_HSTALL_MASK)

#define ESPI_INTENSET_CRCERR_MASK                (0x2000U)
#define ESPI_INTENSET_CRCERR_SHIFT               (13U)
#define ESPI_INTENSET_CRCERR(x)                  (((uint32_t)(((uint32_t)(x)) << ESPI_INTENSET_CRCERR_SHIFT)) & ESPI_INTENSET_CRCERR_MASK)

#define ESPI_INTENSET_GPIO_MASK                  (0x4000U)
#define ESPI_INTENSET_GPIO_SHIFT                 (14U)
#define ESPI_INTENSET_GPIO(x)                    (((uint32_t)(((uint32_t)(x)) << ESPI_INTENSET_GPIO_SHIFT)) & ESPI_INTENSET_GPIO_MASK)
/*! @} */

/*! @name INTENCLR - Interrupt Clear (disable) */
/*! @{ */

#define ESPI_INTENCLR_PORTINT_MASK               (0x1FU)
#define ESPI_INTENCLR_PORTINT_SHIFT              (0U)
#define ESPI_INTENCLR_PORTINT(x)                 (((uint32_t)(((uint32_t)(x)) << ESPI_INTENCLR_PORTINT_SHIFT)) & ESPI_INTENCLR_PORTINT_MASK)

#define ESPI_INTENCLR_P80INT_MASK                (0x100U)
#define ESPI_INTENCLR_P80INT_SHIFT               (8U)
#define ESPI_INTENCLR_P80INT(x)                  (((uint32_t)(((uint32_t)(x)) << ESPI_INTENCLR_P80INT_SHIFT)) & ESPI_INTENCLR_P80INT_MASK)

#define ESPI_INTENCLR_BUSRST_MASK                (0x200U)
#define ESPI_INTENCLR_BUSRST_SHIFT               (9U)
#define ESPI_INTENCLR_BUSRST(x)                  (((uint32_t)(((uint32_t)(x)) << ESPI_INTENCLR_BUSRST_SHIFT)) & ESPI_INTENCLR_BUSRST_MASK)

#define ESPI_INTENCLR_IRQUPD_MASK                (0x400U)
#define ESPI_INTENCLR_IRQUPD_SHIFT               (10U)
#define ESPI_INTENCLR_IRQUPD(x)                  (((uint32_t)(((uint32_t)(x)) << ESPI_INTENCLR_IRQUPD_SHIFT)) & ESPI_INTENCLR_IRQUPD_MASK)

#define ESPI_INTENCLR_WIRECHG_MASK               (0x800U)
#define ESPI_INTENCLR_WIRECHG_SHIFT              (11U)
#define ESPI_INTENCLR_WIRECHG(x)                 (((uint32_t)(((uint32_t)(x)) << ESPI_INTENCLR_WIRECHG_SHIFT)) & ESPI_INTENCLR_WIRECHG_MASK)

