Masmiseim36/iMXRT/targets/iMXRText/devices/iMXRT600/periph/PERI_ESPI.h
#define ESPI_INTENCLR_HSTALL_MASK                (0x1000U)
#define ESPI_INTENCLR_HSTALL_SHIFT               (12U)
#define ESPI_INTENCLR_HSTALL(x)                  (((uint32_t)(((uint32_t)(x)) << ESPI_INTENCLR_HSTALL_SHIFT)) & ESPI_INTENCLR_HSTALL_MASK)

#define ESPI_INTENCLR_CRCERR_MASK                (0x2000U)
#define ESPI_INTENCLR_CRCERR_SHIFT               (13U)
#define ESPI_INTENCLR_CRCERR(x)                  (((uint32_t)(((uint32_t)(x)) << ESPI_INTENCLR_CRCERR_SHIFT)) & ESPI_INTENCLR_CRCERR_MASK)

#define ESPI_INTENCLR_GPIO_MASK                  (0x4000U)
#define ESPI_INTENCLR_GPIO_SHIFT                 (14U)
#define ESPI_INTENCLR_GPIO(x)                    (((uint32_t)(((uint32_t)(x)) << ESPI_INTENCLR_GPIO_SHIFT)) & ESPI_INTENCLR_GPIO_MASK)
/*! @} */

/*! @name INTSTAT - Masked interrupt status (causes) */
/*! @{ */

#define ESPI_INTSTAT_PORTINT_MASK                (0x1FU)
#define ESPI_INTSTAT_PORTINT_SHIFT               (0U)
#define ESPI_INTSTAT_PORTINT(x)                  (((uint32_t)(((uint32_t)(x)) << ESPI_INTSTAT_PORTINT_SHIFT)) & ESPI_INTSTAT_PORTINT_MASK)

#define ESPI_INTSTAT_P80INT_MASK                 (0x100U)
#define ESPI_INTSTAT_P80INT_SHIFT                (8U)
#define ESPI_INTSTAT_P80INT(x)                   (((uint32_t)(((uint32_t)(x)) << ESPI_INTSTAT_P80INT_SHIFT)) & ESPI_INTSTAT_P80INT_MASK)

#define ESPI_INTSTAT_BUSRST_MASK                 (0x200U)
#define ESPI_INTSTAT_BUSRST_SHIFT                (9U)
#define ESPI_INTSTAT_BUSRST(x)                   (((uint32_t)(((uint32_t)(x)) << ESPI_INTSTAT_BUSRST_SHIFT)) & ESPI_INTSTAT_BUSRST_MASK)

#define ESPI_INTSTAT_IRQUPD_MASK                 (0x400U)
#define ESPI_INTSTAT_IRQUPD_SHIFT                (10U)
#define ESPI_INTSTAT_IRQUPD(x)                   (((uint32_t)(((uint32_t)(x)) << ESPI_INTSTAT_IRQUPD_SHIFT)) & ESPI_INTSTAT_IRQUPD_MASK)

#define ESPI_INTSTAT_WIRECHG_MASK                (0x800U)
#define ESPI_INTSTAT_WIRECHG_SHIFT               (11U)
#define ESPI_INTSTAT_WIRECHG(x)                  (((uint32_t)(((uint32_t)(x)) << ESPI_INTSTAT_WIRECHG_SHIFT)) & ESPI_INTSTAT_WIRECHG_MASK)

#define ESPI_INTSTAT_HSTALL_MASK                 (0x1000U)
#define ESPI_INTSTAT_HSTALL_SHIFT                (12U)
#define ESPI_INTSTAT_HSTALL(x)                   (((uint32_t)(((uint32_t)(x)) << ESPI_INTSTAT_HSTALL_SHIFT)) & ESPI_INTSTAT_HSTALL_MASK)

#define ESPI_INTSTAT_CRCERR_MASK                 (0x2000U)
#define ESPI_INTSTAT_CRCERR_SHIFT                (13U)
#define ESPI_INTSTAT_CRCERR(x)                   (((uint32_t)(((uint32_t)(x)) << ESPI_INTSTAT_CRCERR_SHIFT)) & ESPI_INTSTAT_CRCERR_MASK)

#define ESPI_INTSTAT_GPIO_MASK                   (0x4000U)
#define ESPI_INTSTAT_GPIO_SHIFT                  (14U)
#define ESPI_INTSTAT_GPIO(x)                     (((uint32_t)(((uint32_t)(x)) << ESPI_INTSTAT_GPIO_SHIFT)) & ESPI_INTSTAT_GPIO_MASK)
/*! @} */

/*! @name DMACTRL - Selects DMA for Ports (if used) */
/*! @{ */

#define ESPI_DMACTRL_DMA0EN_MASK                 (0x3U)
#define ESPI_DMACTRL_DMA0EN_SHIFT                (0U)
/*! DMA0EN
 *  0b00..Disabled. The DMA channel is not used
 *  0b01..Triggers on Host Read empty (whether endpoint and a byte or mailbox and many bytes). Allows reload of memory
 *  0b10..Triggers on Host Write complete/ready (whether endpoint and a byte or mailbox and many bytes).
 *  0b11..reserved
 */
#define ESPI_DMACTRL_DMA0EN(x)                   (((uint32_t)(((uint32_t)(x)) << ESPI_DMACTRL_DMA0EN_SHIFT)) & ESPI_DMACTRL_DMA0EN_MASK)

#define ESPI_DMACTRL_DMA1EN_MASK                 (0xCU)
#define ESPI_DMACTRL_DMA1EN_SHIFT                (2U)
/*! DMA1EN
 *  0b00..Disabled. The DMA channel is not used
 *  0b01..Triggers on Host Read empty (whether endpoint and a byte or mailbox and many bytes). Allows reload of memory
 *  0b10..Triggers on Host Write complete/ready (whether endpoint and a byte or mailbox and many bytes).
 *  0b11..reserved
 */
#define ESPI_DMACTRL_DMA1EN(x)                   (((uint32_t)(((uint32_t)(x)) << ESPI_DMACTRL_DMA1EN_SHIFT)) & ESPI_DMACTRL_DMA1EN_MASK)

#define ESPI_DMACTRL_DMA0PORT_MASK               (0xF00U)
#define ESPI_DMACTRL_DMA0PORT_SHIFT              (8U)
#define ESPI_DMACTRL_DMA0PORT(x)                 (((uint32_t)(((uint32_t)(x)) << ESPI_DMACTRL_DMA0PORT_SHIFT)) & ESPI_DMACTRL_DMA0PORT_MASK)

#define ESPI_DMACTRL_DMA1PORT_MASK               (0xF000U)
#define ESPI_DMACTRL_DMA1PORT_SHIFT              (12U)
#define ESPI_DMACTRL_DMA1PORT(x)                 (((uint32_t)(((uint32_t)(x)) << ESPI_DMACTRL_DMA1PORT_SHIFT)) & ESPI_DMACTRL_DMA1PORT_MASK)

#define ESPI_DMACTRL_CNT0_MASK                   (0x7F0000U)
#define ESPI_DMACTRL_CNT0_SHIFT                  (16U)
#define ESPI_DMACTRL_CNT0(x)                     (((uint32_t)(((uint32_t)(x)) << ESPI_DMACTRL_CNT0_SHIFT)) & ESPI_DMACTRL_CNT0_MASK)

#define ESPI_DMACTRL_CNT1_MASK                   (0x7F000000U)
#define ESPI_DMACTRL_CNT1_SHIFT                  (24U)
#define ESPI_DMACTRL_CNT1(x)                     (((uint32_t)(((uint32_t)(x)) << ESPI_DMACTRL_CNT1_SHIFT)) & ESPI_DMACTRL_CNT1_MASK)
/*! @} */

/*! @name RAMBASE - Address of RAM to use for data. This tells the application where the RAM is located (up to 16K addressable). */
/*! @{ */

#define ESPI_RAMBASE_ZERO_MASK                   (0xFFFU)
#define ESPI_RAMBASE_ZERO_SHIFT                  (0U)
/*! ZERO - Always 0 */
#define ESPI_RAMBASE_ZERO(x)                     (((uint32_t)(((uint32_t)(x)) << ESPI_RAMBASE_ZERO_SHIFT)) & ESPI_RAMBASE_ZERO_MASK)

#define ESPI_RAMBASE_RAM_MASK                    (0xFFFFF000U)
#define ESPI_RAMBASE_RAM_SHIFT                   (12U)
#define ESPI_RAMBASE_RAM(x)                      (((uint32_t)(((uint32_t)(x)) << ESPI_RAMBASE_RAM_SHIFT)) & ESPI_RAMBASE_RAM_MASK)
/*! @} */

/*! @name MAPBASE - Base0 and Base1 mapped offsets for ports */
/*! @{ */

#define ESPI_MAPBASE_BASE0_MASK                  (0xFFFFU)
#define ESPI_MAPBASE_BASE0_SHIFT                 (0U)
#define ESPI_MAPBASE_BASE0(x)                    (((uint32_t)(((uint32_t)(x)) << ESPI_MAPBASE_BASE0_SHIFT)) & ESPI_MAPBASE_BASE0_MASK)

