Masmiseim36/iMXRT/targets/iMXRText/devices/iMXRT600/periph/PERI_ESPI.h
#define ESPI_MAPBASE_BASE1_MASK                  (0xFFFF0000U)
#define ESPI_MAPBASE_BASE1_SHIFT                 (16U)
#define ESPI_MAPBASE_BASE1(x)                    (((uint32_t)(((uint32_t)(x)) << ESPI_MAPBASE_BASE1_SHIFT)) & ESPI_MAPBASE_BASE1_MASK)
/*! @} */

/*! @name IRQPUSH - IRQ to drive into Host (with eSPI) */
/*! @{ */

#define ESPI_IRQPUSH_IRQ_MASK                    (0xFFU)
#define ESPI_IRQPUSH_IRQ_SHIFT                   (0U)
#define ESPI_IRQPUSH_IRQ(x)                      (((uint32_t)(((uint32_t)(x)) << ESPI_IRQPUSH_IRQ_SHIFT)) & ESPI_IRQPUSH_IRQ_MASK)

#define ESPI_IRQPUSH_DONE_MASK                   (0x100U)
#define ESPI_IRQPUSH_DONE_SHIFT                  (8U)
#define ESPI_IRQPUSH_DONE(x)                     (((uint32_t)(((uint32_t)(x)) << ESPI_IRQPUSH_DONE_SHIFT)) & ESPI_IRQPUSH_DONE_MASK)
/*! @} */

/*! @name WIREWO - Wire states for Host to see; if LPC, this is the IRQ states. */
/*! @{ */

#define ESPI_WIREWO_WIRES_MASK                   (0x3FFFFU)
#define ESPI_WIREWO_WIRES_SHIFT                  (0U)
#define ESPI_WIREWO_WIRES(x)                     (((uint32_t)(((uint32_t)(x)) << ESPI_WIREWO_WIRES_SHIFT)) & ESPI_WIREWO_WIRES_MASK)

#define ESPI_WIREWO_DONE_MASK                    (0x80000000U)
#define ESPI_WIREWO_DONE_SHIFT                   (31U)
#define ESPI_WIREWO_DONE(x)                      (((uint32_t)(((uint32_t)(x)) << ESPI_WIREWO_DONE_SHIFT)) & ESPI_WIREWO_DONE_MASK)
/*! @} */

/*! @name WIRERO - Wire states from Host */
/*! @{ */

#define ESPI_WIRERO_WIRES_MASK                   (0x3FFFFFU)
#define ESPI_WIRERO_WIRES_SHIFT                  (0U)
#define ESPI_WIRERO_WIRES(x)                     (((uint32_t)(((uint32_t)(x)) << ESPI_WIRERO_WIRES_SHIFT)) & ESPI_WIRERO_WIRES_MASK)
/*! @} */

/*! @name P80STAT - Port 80 Status (byte and prev byte) */
/*! @{ */

#define ESPI_P80STAT_CURR_MASK                   (0xFFU)
#define ESPI_P80STAT_CURR_SHIFT                  (0U)
/*! CURR - Has the Current Port80 value. */
#define ESPI_P80STAT_CURR(x)                     (((uint32_t)(((uint32_t)(x)) << ESPI_P80STAT_CURR_SHIFT)) & ESPI_P80STAT_CURR_MASK)

#define ESPI_P80STAT_PREV_MASK                   (0xFF00U)
#define ESPI_P80STAT_PREV_SHIFT                  (8U)
/*! PREV - Has the previous Port80 value. */
#define ESPI_P80STAT_PREV(x)                     (((uint32_t)(((uint32_t)(x)) << ESPI_P80STAT_PREV_SHIFT)) & ESPI_P80STAT_PREV_MASK)

#define ESPI_P80STAT_CNT_MASK                    (0xF0000U)
#define ESPI_P80STAT_CNT_SHIFT                   (16U)
/*! CNT - A counter (set to 0 on enable of p80) which increments with each new value. Will wrap back to 0. */
#define ESPI_P80STAT_CNT(x)                      (((uint32_t)(((uint32_t)(x)) << ESPI_P80STAT_CNT_SHIFT)) & ESPI_P80STAT_CNT_MASK)

#define ESPI_P80STAT_RST_MASK                    (0x100000U)
#define ESPI_P80STAT_RST_SHIFT                   (20U)
/*! RST - Resets counter, CNT, back to 0. */
#define ESPI_P80STAT_RST(x)                      (((uint32_t)(((uint32_t)(x)) << ESPI_P80STAT_RST_SHIFT)) & ESPI_P80STAT_RST_MASK)
/*! @} */

/*! @name STATADDR - Location of Status block in memory space, if enabled. */
/*! @{ */

#define ESPI_STATADDR_OFF_MASK                   (0xFFF8U)
#define ESPI_STATADDR_OFF_SHIFT                  (3U)
#define ESPI_STATADDR_OFF(x)                     (((uint32_t)(((uint32_t)(x)) << ESPI_STATADDR_OFF_SHIFT)) & ESPI_STATADDR_OFF_MASK)

#define ESPI_STATADDR_BASE_MASK                  (0x30000U)
#define ESPI_STATADDR_BASE_SHIFT                 (16U)
/*! BASE - The meaning is dependent on type of port:
 *  0b00..Is offset from 0 in host memory or IO space.
 *  0b01..Uses Base1 offset in host memory (see MAPBASE reg)
 *  0b10..Uses Base2 offset in host memory (see MAPBASE reg)
 *  0b11..Reserved
 */
#define ESPI_STATADDR_BASE(x)                    (((uint32_t)(((uint32_t)(x)) << ESPI_STATADDR_BASE_SHIFT)) & ESPI_STATADDR_BASE_MASK)
/*! @} */

/*! @name ESPICAP - eSPI Capabilities of MCU to send to Host */
/*! @{ */

#define ESPI_ESPICAP_SPICAP_MASK                 (0x3U)
#define ESPI_ESPICAP_SPICAP_SHIFT                (0U)
/*! SPICAP - SPI mode allowed (host still has to select):
 *  0b00..SPI only
 *  0b01..BiSPI and SPI
 *  0b10..FLEXSPI and SPI
 *  0b11..any
 */
#define ESPI_ESPICAP_SPICAP(x)                   (((uint32_t)(((uint32_t)(x)) << ESPI_ESPICAP_SPICAP_SHIFT)) & ESPI_ESPICAP_SPICAP_MASK)

#define ESPI_ESPICAP_MAXSPD_MASK                 (0x70U)
#define ESPI_ESPICAP_MAXSPD_SHIFT                (4U)
/*! MAXSPD - Maximum SPI Clock speed to allow (host still chooses):
 *  0b000..<=20MHz
 *  0b001..<=25MHz (may be 24Mhz)
 *  0b010..<=33MHz (may be 30MHz)
 *  0b011..<=50MHz (may be 48MHz)
 *  0b100..<= 66MHz (may be 60MHz)
 */
#define ESPI_ESPICAP_MAXSPD(x)                   (((uint32_t)(((uint32_t)(x)) << ESPI_ESPICAP_MAXSPD_SHIFT)) & ESPI_ESPICAP_MAXSPD_MASK)

#define ESPI_ESPICAP_ALPIN_MASK                  (0x80U)
#define ESPI_ESPICAP_ALPIN_SHIFT                 (7U)
/*! ALPIN - Allow Alert to be a pin if the Host wants */
#define ESPI_ESPICAP_ALPIN(x)                    (((uint32_t)(((uint32_t)(x)) << ESPI_ESPICAP_ALPIN_SHIFT)) & ESPI_ESPICAP_ALPIN_MASK)

#define ESPI_ESPICAP_OOBOK_MASK                  (0x100U)
#define ESPI_ESPICAP_OOBOK_SHIFT                 (8U)
/*! OOBOK - If 1, allow OOB */
#define ESPI_ESPICAP_OOBOK(x)                    (((uint32_t)(((uint32_t)(x)) << ESPI_ESPICAP_OOBOK_SHIFT)) & ESPI_ESPICAP_OOBOK_MASK)

#define ESPI_ESPICAP_MEMMX_MASK                  (0x200U)
#define ESPI_ESPICAP_MEMMX_SHIFT                 (9U)
/*! MEMMX - If 1, allow 128 byte payload for memory and OOB access, else limit to 64 */
#define ESPI_ESPICAP_MEMMX(x)                    (((uint32_t)(((uint32_t)(x)) << ESPI_ESPICAP_MEMMX_SHIFT)) & ESPI_ESPICAP_MEMMX_MASK)

#define ESPI_ESPICAP_FLASHMX_MASK                (0xC00U)
#define ESPI_ESPICAP_FLASHMX_SHIFT               (10U)
/*! FLASHMX - Selects max Flash payload size to allow:
 *  0b00..64 bytes
 *  0b01..128 bytes
 *  0b10..256 bytes
 *  0b11..512 bytes
 */
#define ESPI_ESPICAP_FLASHMX(x)                  (((uint32_t)(((uint32_t)(x)) << ESPI_ESPICAP_FLASHMX_SHIFT)) & ESPI_ESPICAP_FLASHMX_MASK)

#define ESPI_ESPICAP_SAF_MASK                    (0x1000U)
#define ESPI_ESPICAP_SAF_SHIFT                   (12U)
#define ESPI_ESPICAP_SAF(x)                      (((uint32_t)(((uint32_t)(x)) << ESPI_ESPICAP_SAF_SHIFT)) & ESPI_ESPICAP_SAF_MASK)

#define ESPI_ESPICAP_SAFERA_MASK                 (0x6000U)
#define ESPI_ESPICAP_SAFERA_SHIFT                (13U)
/*! SAFERA
 *  0b00..Minimally 2KB
 *  0b01..Minimally 4KB
 *  0b10..Minimally 8KB
 *  0b11..Minimally 16KB
 */
#define ESPI_ESPICAP_SAFERA(x)                   (((uint32_t)(((uint32_t)(x)) << ESPI_ESPICAP_SAFERA_SHIFT)) & ESPI_ESPICAP_SAFERA_MASK)
/*! @} */

/*! @name ESPICFG - eSPI Configuration settings from eSPI */
/*! @{ */

#define ESPI_ESPICFG_MEMSZ_MASK                  (0x1U)
#define ESPI_ESPICFG_MEMSZ_SHIFT                 (0U)
#define ESPI_ESPICFG_MEMSZ(x)                    (((uint32_t)(((uint32_t)(x)) << ESPI_ESPICFG_MEMSZ_SHIFT)) & ESPI_ESPICFG_MEMSZ_MASK)

