Masmiseim36/iMXRT/targets/iMXRText/devices/iMXRT600/periph/PERI_ESPI.h
#define ESPI_ESPICFG_FLASHSZ_MASK                (0x6U)
#define ESPI_ESPICFG_FLASHSZ_SHIFT               (1U)
#define ESPI_ESPICFG_FLASHSZ(x)                  (((uint32_t)(((uint32_t)(x)) << ESPI_ESPICFG_FLASHSZ_SHIFT)) & ESPI_ESPICFG_FLASHSZ_MASK)

#define ESPI_ESPICFG_SPIMOD_MASK                 (0x18U)
#define ESPI_ESPICFG_SPIMOD_SHIFT                (3U)
/*! SPIMOD
 *  0b00..SPI
 *  0b01..BiSPI
 *  0b10..FLEXSPI
 */
#define ESPI_ESPICFG_SPIMOD(x)                   (((uint32_t)(((uint32_t)(x)) << ESPI_ESPICFG_SPIMOD_SHIFT)) & ESPI_ESPICFG_SPIMOD_MASK)

#define ESPI_ESPICFG_ALERT_MASK                  (0x20U)
#define ESPI_ESPICFG_ALERT_SHIFT                 (5U)
/*! ALERT - Alert is a pin vs. MISO */
#define ESPI_ESPICFG_ALERT(x)                    (((uint32_t)(((uint32_t)(x)) << ESPI_ESPICFG_ALERT_SHIFT)) & ESPI_ESPICFG_ALERT_MASK)

#define ESPI_ESPICFG_ALERTOD_MASK                (0x40U)
#define ESPI_ESPICFG_ALERTOD_SHIFT               (6U)
/*! ALERTOD - Alert is OD as a pin */
#define ESPI_ESPICFG_ALERTOD(x)                  (((uint32_t)(((uint32_t)(x)) << ESPI_ESPICFG_ALERTOD_SHIFT)) & ESPI_ESPICFG_ALERTOD_MASK)

#define ESPI_ESPICFG_SPISPD_MASK                 (0x380U)
#define ESPI_ESPICFG_SPISPD_SHIFT                (7U)
/*! SPISPD
 *  0b000..20MHz or less
 *  0b001..25MHz or 24MHz
 *  0b010..33MHz or 30MHz
 *  0b011..50MHz or 48MHz
 *  0b100..66MHz or 60MHz
 */
#define ESPI_ESPICFG_SPISPD(x)                   (((uint32_t)(((uint32_t)(x)) << ESPI_ESPICFG_SPISPD_SHIFT)) & ESPI_ESPICFG_SPISPD_MASK)

#define ESPI_ESPICFG_CRC_MASK                    (0x400U)
#define ESPI_ESPICFG_CRC_SHIFT                   (10U)
/*! CRC - CRC checking is enabled */
#define ESPI_ESPICFG_CRC(x)                      (((uint32_t)(((uint32_t)(x)) << ESPI_ESPICFG_CRC_SHIFT)) & ESPI_ESPICFG_CRC_MASK)

#define ESPI_ESPICFG_BUSMOK_MASK                 (0x800U)
#define ESPI_ESPICFG_BUSMOK_SHIFT                (11U)
/*! BUSMOK - Bus Master is OK */
#define ESPI_ESPICFG_BUSMOK(x)                   (((uint32_t)(((uint32_t)(x)) << ESPI_ESPICFG_BUSMOK_SHIFT)) & ESPI_ESPICFG_BUSMOK_MASK)

#define ESPI_ESPICFG_MEMENA_MASK                 (0x1000U)
#define ESPI_ESPICFG_MEMENA_SHIFT                (12U)
/*! MEMENA - Channel 0 (memory) is enabled */
#define ESPI_ESPICFG_MEMENA(x)                   (((uint32_t)(((uint32_t)(x)) << ESPI_ESPICFG_MEMENA_SHIFT)) & ESPI_ESPICFG_MEMENA_MASK)

#define ESPI_ESPICFG_VWOK_MASK                   (0x2000U)
#define ESPI_ESPICFG_VWOK_SHIFT                  (13U)
/*! VWOK - Channel 1 (Vwire) is enabled */
#define ESPI_ESPICFG_VWOK(x)                     (((uint32_t)(((uint32_t)(x)) << ESPI_ESPICFG_VWOK_SHIFT)) & ESPI_ESPICFG_VWOK_MASK)

#define ESPI_ESPICFG_OOBOK_MASK                  (0x4000U)
#define ESPI_ESPICFG_OOBOK_SHIFT                 (14U)
/*! OOBOK - Channel 2 (OOB) is enabled */
#define ESPI_ESPICFG_OOBOK(x)                    (((uint32_t)(((uint32_t)(x)) << ESPI_ESPICFG_OOBOK_SHIFT)) & ESPI_ESPICFG_OOBOK_MASK)

#define ESPI_ESPICFG_FLSHERA_MASK                (0x38000U)
#define ESPI_ESPICFG_FLSHERA_SHIFT               (15U)
/*! FLSHERA - Flash erase size (and if enabled):
 *  0b000..Flash is not enabled
 *  0b001..Erase is 4K
 *  0b010..Erase is 64K
 *  0b011..Erase allows 4K and 64K
 *  0b100..Erase is 128K
 *  0b101..Erase is 256K
 */
#define ESPI_ESPICFG_FLSHERA(x)                  (((uint32_t)(((uint32_t)(x)) << ESPI_ESPICFG_FLSHERA_SHIFT)) & ESPI_ESPICFG_FLSHERA_MASK)

#define ESPI_ESPICFG_FLSHOK_MASK                 (0x40000U)
#define ESPI_ESPICFG_FLSHOK_SHIFT                (18U)
/*! FLSHOK - Channel 3 (Flash) is enabled. */
#define ESPI_ESPICFG_FLSHOK(x)                   (((uint32_t)(((uint32_t)(x)) << ESPI_ESPICFG_FLSHOK_SHIFT)) & ESPI_ESPICFG_FLSHOK_MASK)

#define ESPI_ESPICFG_SAF_MASK                    (0x80000U)
#define ESPI_ESPICFG_SAF_SHIFT                   (19U)
/*! SAF - Is 1 if Slave Attached Flash is enabled. Only possible if SAF is set in ESPICAP. */
#define ESPI_ESPICFG_SAF(x)                      (((uint32_t)(((uint32_t)(x)) << ESPI_ESPICFG_SAF_SHIFT)) & ESPI_ESPICFG_SAF_MASK)
/*! @} */

/*! @name ESPIMISC - Miscellaneous uses, such as Alert pin as GPIO (when not used for Alert). */
/*! @{ */

#define ESPI_ESPIMISC_GPIO_OE_MASK               (0x1U)
#define ESPI_ESPIMISC_GPIO_OE_SHIFT              (0U)
#define ESPI_ESPIMISC_GPIO_OE(x)                 (((uint32_t)(((uint32_t)(x)) << ESPI_ESPIMISC_GPIO_OE_SHIFT)) & ESPI_ESPIMISC_GPIO_OE_MASK)

#define ESPI_ESPIMISC_GPIO_OD_MASK               (0x2U)
#define ESPI_ESPIMISC_GPIO_OD_SHIFT              (1U)
#define ESPI_ESPIMISC_GPIO_OD(x)                 (((uint32_t)(((uint32_t)(x)) << ESPI_ESPIMISC_GPIO_OD_SHIFT)) & ESPI_ESPIMISC_GPIO_OD_MASK)

#define ESPI_ESPIMISC_GPIO_OUT_MASK              (0x4U)
#define ESPI_ESPIMISC_GPIO_OUT_SHIFT             (2U)
#define ESPI_ESPIMISC_GPIO_OUT(x)                (((uint32_t)(((uint32_t)(x)) << ESPI_ESPIMISC_GPIO_OUT_SHIFT)) & ESPI_ESPIMISC_GPIO_OUT_MASK)

#define ESPI_ESPIMISC_GPIO_IN_MASK               (0x8U)
#define ESPI_ESPIMISC_GPIO_IN_SHIFT              (3U)
#define ESPI_ESPIMISC_GPIO_IN(x)                 (((uint32_t)(((uint32_t)(x)) << ESPI_ESPIMISC_GPIO_IN_SHIFT)) & ESPI_ESPIMISC_GPIO_IN_MASK)

#define ESPI_ESPIMISC_RISGP_MASK                 (0x10U)
#define ESPI_ESPIMISC_RISGP_SHIFT                (4U)
#define ESPI_ESPIMISC_RISGP(x)                   (((uint32_t)(((uint32_t)(x)) << ESPI_ESPIMISC_RISGP_SHIFT)) & ESPI_ESPIMISC_RISGP_MASK)

#define ESPI_ESPIMISC_PWRSAV_MASK                (0x80000000U)
#define ESPI_ESPIMISC_PWRSAV_SHIFT               (31U)
#define ESPI_ESPIMISC_PWRSAV(x)                  (((uint32_t)(((uint32_t)(x)) << ESPI_ESPIMISC_PWRSAV_SHIFT)) & ESPI_ESPIMISC_PWRSAV_MASK)
/*! @} */

/*! @name CFG -  */
/*! @{ */

#define ESPI_CFG_TYPE_MASK                       (0xFU)
#define ESPI_CFG_TYPE_SHIFT                      (0U)
/*! Type
 *  0b0000..Unconfigured (reset condition)
 *  0b0001..ACPI style Endpoint
 *  0b0010..ACPI style Index/Data
 *  0b0011..reserved
 *  0b0100..Bus Master Mem Single
 *  0b0101..Bus Master Flash Single
 *  0b0110..reserved
 *  0b0111..reserved
 *  0b1000..Mailbox Shared
 *  0b1001..Mailbox Single
 *  0b1010..Mailbox Split
 *  0b1011..Mailbox OOB Split
 *  0b1100..Mailbox OEM
 *  0b1101..reserved
 *  0b1110..reserved
 *  0b1111..reserved
 */
#define ESPI_CFG_TYPE(x)                         (((uint32_t)(((uint32_t)(x)) << ESPI_CFG_TYPE_SHIFT)) & ESPI_CFG_TYPE_MASK)

#define ESPI_CFG_DIRECTION_MASK                  (0x60U)
#define ESPI_CFG_DIRECTION_SHIFT                 (5U)
#define ESPI_CFG_DIRECTION(x)                    (((uint32_t)(((uint32_t)(x)) << ESPI_CFG_DIRECTION_SHIFT)) & ESPI_CFG_DIRECTION_MASK)

#define ESPI_CFG_MBINTALL_MASK                   (0x80U)
#define ESPI_CFG_MBINTALL_SHIFT                  (7U)
#define ESPI_CFG_MBINTALL(x)                     (((uint32_t)(((uint32_t)(x)) << ESPI_CFG_MBINTALL_SHIFT)) & ESPI_CFG_MBINTALL_MASK)

