Masmiseim36/iMXRT/targets/iMXRText/devices/iMXRT600/periph/PERI_ESPI.h
#define ESPI_CFG_STALLRD_MASK                    (0x100U)
#define ESPI_CFG_STALLRD_SHIFT                   (8U)
#define ESPI_CFG_STALLRD(x)                      (((uint32_t)(((uint32_t)(x)) << ESPI_CFG_STALLRD_SHIFT)) & ESPI_CFG_STALLRD_MASK)

#define ESPI_CFG_STALLWR_MASK                    (0x200U)
#define ESPI_CFG_STALLWR_SHIFT                   (9U)
#define ESPI_CFG_STALLWR(x)                      (((uint32_t)(((uint32_t)(x)) << ESPI_CFG_STALLWR_SHIFT)) & ESPI_CFG_STALLWR_MASK)

#define ESPI_CFG_ERRORIGN_MASK                   (0x400U)
#define ESPI_CFG_ERRORIGN_SHIFT                  (10U)
#define ESPI_CFG_ERRORIGN(x)                     (((uint32_t)(((uint32_t)(x)) << ESPI_CFG_ERRORIGN_SHIFT)) & ESPI_CFG_ERRORIGN_MASK)
/*! @} */

/* The count of ESPI_CFG */
#define ESPI_CFG_COUNT                           (5U)

/*! @name STAT -  */
/*! @{ */

#define ESPI_STAT_RDSTAT_MASK                    (0x3U)
#define ESPI_STAT_RDSTAT_SHIFT                   (0U)
#define ESPI_STAT_RDSTAT(x)                      (((uint32_t)(((uint32_t)(x)) << ESPI_STAT_RDSTAT_SHIFT)) & ESPI_STAT_RDSTAT_MASK)

#define ESPI_STAT_WRSTAT_MASK                    (0xCU)
#define ESPI_STAT_WRSTAT_SHIFT                   (2U)
#define ESPI_STAT_WRSTAT(x)                      (((uint32_t)(((uint32_t)(x)) << ESPI_STAT_WRSTAT_SHIFT)) & ESPI_STAT_WRSTAT_MASK)

#define ESPI_STAT_INTERR_MASK                    (0x100U)
#define ESPI_STAT_INTERR_SHIFT                   (8U)
#define ESPI_STAT_INTERR(x)                      (((uint32_t)(((uint32_t)(x)) << ESPI_STAT_INTERR_SHIFT)) & ESPI_STAT_INTERR_MASK)

#define ESPI_STAT_INTRD_MASK                     (0x200U)
#define ESPI_STAT_INTRD_SHIFT                    (9U)
#define ESPI_STAT_INTRD(x)                       (((uint32_t)(((uint32_t)(x)) << ESPI_STAT_INTRD_SHIFT)) & ESPI_STAT_INTRD_MASK)

#define ESPI_STAT_INTWR_MASK                     (0x400U)
#define ESPI_STAT_INTWR_SHIFT                    (10U)
#define ESPI_STAT_INTWR(x)                       (((uint32_t)(((uint32_t)(x)) << ESPI_STAT_INTWR_SHIFT)) & ESPI_STAT_INTWR_MASK)

#define ESPI_STAT_INTSPC_MASK                    (0x7800U)
#define ESPI_STAT_INTSPC_SHIFT                   (11U)
#define ESPI_STAT_INTSPC(x)                      (((uint32_t)(((uint32_t)(x)) << ESPI_STAT_INTSPC_SHIFT)) & ESPI_STAT_INTSPC_MASK)

#define ESPI_STAT_ERR_MASK                       (0xF0000U)
#define ESPI_STAT_ERR_SHIFT                      (16U)
#define ESPI_STAT_ERR(x)                         (((uint32_t)(((uint32_t)(x)) << ESPI_STAT_ERR_SHIFT)) & ESPI_STAT_ERR_MASK)
/*! @} */

/* The count of ESPI_STAT */
#define ESPI_STAT_COUNT                          (5U)

/*! @name IRULESTAT -  */
/*! @{ */

#define ESPI_IRULESTAT_USTAT_MASK                (0x1FU)
#define ESPI_IRULESTAT_USTAT_SHIFT               (0U)
/*! USTAT - User defined status bits. These are salted into the status register as specified in section 4.1 and 4.6. */
#define ESPI_IRULESTAT_USTAT(x)                  (((uint32_t)(((uint32_t)(x)) << ESPI_IRULESTAT_USTAT_SHIFT)) & ESPI_IRULESTAT_USTAT_MASK)

#define ESPI_IRULESTAT_INTERR_MASK               (0x100U)
#define ESPI_IRULESTAT_INTERR_SHIFT              (8U)
/*! INTERR - Interrupt if an error is detected (classes of error defined in section 2.14) */
#define ESPI_IRULESTAT_INTERR(x)                 (((uint32_t)(((uint32_t)(x)) << ESPI_IRULESTAT_INTERR_SHIFT)) & ESPI_IRULESTAT_INTERR_MASK)

#define ESPI_IRULESTAT_INTRD_MASK                (0x200U)
#define ESPI_IRULESTAT_INTRD_SHIFT               (9U)
/*! INTRD - Interrupt if Read or 1st Read or Bus master Started. */
#define ESPI_IRULESTAT_INTRD(x)                  (((uint32_t)(((uint32_t)(x)) << ESPI_IRULESTAT_INTRD_SHIFT)) & ESPI_IRULESTAT_INTRD_MASK)

#define ESPI_IRULESTAT_INTWR_MASK                (0x400U)
#define ESPI_IRULESTAT_INTWR_SHIFT               (10U)
/*! INTWR - Interrupt if Write or 1st Write or Bus master Finished. */
#define ESPI_IRULESTAT_INTWR(x)                  (((uint32_t)(((uint32_t)(x)) << ESPI_IRULESTAT_INTWR_SHIFT)) & ESPI_IRULESTAT_INTWR_MASK)

#define ESPI_IRULESTAT_INTSPC_MASK               (0x7800U)
#define ESPI_IRULESTAT_INTSPC_SHIFT              (11U)
#define ESPI_IRULESTAT_INTSPC(x)                 (((uint32_t)(((uint32_t)(x)) << ESPI_IRULESTAT_INTSPC_SHIFT)) & ESPI_IRULESTAT_INTSPC_MASK)

#define ESPI_IRULESTAT_SSTCL_MASK                (0xF0000U)
#define ESPI_IRULESTAT_SSTCL_SHIFT               (16U)
#define ESPI_IRULESTAT_SSTCL(x)                  (((uint32_t)(((uint32_t)(x)) << ESPI_IRULESTAT_SSTCL_SHIFT)) & ESPI_IRULESTAT_SSTCL_MASK)

#define ESPI_IRULESTAT_SRST_MASK                 (0x100000U)
#define ESPI_IRULESTAT_SRST_SHIFT                (20U)
#define ESPI_IRULESTAT_SRST(x)                   (((uint32_t)(((uint32_t)(x)) << ESPI_IRULESTAT_SRST_SHIFT)) & ESPI_IRULESTAT_SRST_MASK)
/*! @} */

/* The count of ESPI_IRULESTAT */
#define ESPI_IRULESTAT_COUNT                     (5U)

/*! @name ADDR -  */
/*! @{ */

#define ESPI_ADDR_OFF_MASK                       (0xFFFFU)
#define ESPI_ADDR_OFF_SHIFT                      (0U)
#define ESPI_ADDR_OFF(x)                         (((uint32_t)(((uint32_t)(x)) << ESPI_ADDR_OFF_SHIFT)) & ESPI_ADDR_OFF_MASK)

#define ESPI_ADDR_BASE_OR_ASZ_MASK               (0x30000U)
#define ESPI_ADDR_BASE_OR_ASZ_SHIFT              (16U)
/*! BASE_or_ASZ - The meaning is dependent on type of port:
 *  0b00..Is offset from 0 in host memory or IO space.
 *  0b01..Uses BASE0 offset in host memory
 *  0b10..Uses BASE1 offset in host memory
 *  0b11..Reserved - do not use
 */
#define ESPI_ADDR_BASE_OR_ASZ(x)                 (((uint32_t)(((uint32_t)(x)) << ESPI_ADDR_BASE_OR_ASZ_SHIFT)) & ESPI_ADDR_BASE_OR_ASZ_MASK)

#define ESPI_ADDR_IDXOFF_MASK                    (0xF000000U)
#define ESPI_ADDR_IDXOFF_SHIFT                   (24U)
#define ESPI_ADDR_IDXOFF(x)                      (((uint32_t)(((uint32_t)(x)) << ESPI_ADDR_IDXOFF_SHIFT)) & ESPI_ADDR_IDXOFF_MASK)

#define ESPI_ADDR_IDX1ST_MASK                    (0x10000000U)
#define ESPI_ADDR_IDX1ST_SHIFT                   (28U)
#define ESPI_ADDR_IDX1ST(x)                      (((uint32_t)(((uint32_t)(x)) << ESPI_ADDR_IDX1ST_SHIFT)) & ESPI_ADDR_IDX1ST_MASK)
/*! @} */

/* The count of ESPI_ADDR */
#define ESPI_ADDR_COUNT                          (5U)

/*! @name OMFLEN -  */
/*! @{ */

#define ESPI_OMFLEN_LEN_MASK                     (0x7FU)
#define ESPI_OMFLEN_LEN_SHIFT                    (0U)
#define ESPI_OMFLEN_LEN(x)                       (((uint32_t)(((uint32_t)(x)) << ESPI_OMFLEN_LEN_SHIFT)) & ESPI_OMFLEN_LEN_MASK)

#define ESPI_OMFLEN_TRANS_MASK                   (0x3000U)
#define ESPI_OMFLEN_TRANS_SHIFT                  (12U)
#define ESPI_OMFLEN_TRANS(x)                     (((uint32_t)(((uint32_t)(x)) << ESPI_OMFLEN_TRANS_SHIFT)) & ESPI_OMFLEN_TRANS_MASK)
/*! @} */

/* The count of ESPI_OMFLEN */
#define ESPI_OMFLEN_COUNT                        (5U)

/*! @name DATAIN -  */
/*! @{ */

#define ESPI_DATAIN_DATA_LEN_MASK                (0xFFU)
#define ESPI_DATAIN_DATA_LEN_SHIFT               (0U)
#define ESPI_DATAIN_DATA_LEN(x)                  (((uint32_t)(((uint32_t)(x)) << ESPI_DATAIN_DATA_LEN_SHIFT)) & ESPI_DATAIN_DATA_LEN_MASK)

#define ESPI_DATAIN_DIR_MASK                     (0x100U)
#define ESPI_DATAIN_DIR_SHIFT                    (8U)
#define ESPI_DATAIN_DIR(x)                       (((uint32_t)(((uint32_t)(x)) << ESPI_DATAIN_DIR_SHIFT)) & ESPI_DATAIN_DIR_MASK)

#define ESPI_DATAIN_IDX_MASK                     (0x3FF0000U)
#define ESPI_DATAIN_IDX_SHIFT                    (16U)
#define ESPI_DATAIN_IDX(x)                       (((uint32_t)(((uint32_t)(x)) << ESPI_DATAIN_IDX_SHIFT)) & ESPI_DATAIN_IDX_MASK)
/*! @} */

/* The count of ESPI_DATAIN */
#define ESPI_DATAIN_COUNT                        (5U)

/*! @name DATAOUT -  */
/*! @{ */

