Masmiseim36/iMXRT/targets/iMXRText/devices/iMXRT600/periph/PERI_ESPI.h
#define ESPI_DATAOUT_DATA_MASK                   (0xFFU)
#define ESPI_DATAOUT_DATA_SHIFT                  (0U)
#define ESPI_DATAOUT_DATA(x)                     (((uint32_t)(((uint32_t)(x)) << ESPI_DATAOUT_DATA_SHIFT)) & ESPI_DATAOUT_DATA_MASK)
/*! @} */

/* The count of ESPI_DATAOUT */
#define ESPI_DATAOUT_COUNT                       (5U)

/*! @name RAMUSE -  */
/*! @{ */

#define ESPI_RAMUSE_OFF_MASK                     (0xFFFU)
#define ESPI_RAMUSE_OFF_SHIFT                    (0U)
#define ESPI_RAMUSE_OFF(x)                       (((uint32_t)(((uint32_t)(x)) << ESPI_RAMUSE_OFF_SHIFT)) & ESPI_RAMUSE_OFF_MASK)

#define ESPI_RAMUSE_LEN_MASK                     (0x70000U)
#define ESPI_RAMUSE_LEN_SHIFT                    (16U)
#define ESPI_RAMUSE_LEN(x)                       (((uint32_t)(((uint32_t)(x)) << ESPI_RAMUSE_LEN_SHIFT)) & ESPI_RAMUSE_LEN_MASK)
/*! @} */

/* The count of ESPI_RAMUSE */
#define ESPI_RAMUSE_COUNT                        (5U)


/*!
 * @}
 */ /* end of group ESPI_Register_Masks */


/*!
 * @}
 */ /* end of group ESPI_Peripheral_Access_Layer */


/*
** End of section using anonymous unions
*/

#if defined(__ARMCC_VERSION)
  #if (__ARMCC_VERSION >= 6010050)
    #pragma clang diagnostic pop
  #else
    #pragma pop
  #endif
#elif defined(__GNUC__)
  /* leave anonymous unions enabled */
#elif defined(__IAR_SYSTEMS_ICC__)
  #pragma language=default
#elif defined(__XTENSA__)
  /* leave anonymous unions enabled */
#else
  #error Not supported compiler type
#endif

/*!
 * @}
 */ /* end of group Peripheral_access_layer */


#endif  /* PERI_ESPI_H_ */

